dennisppaul/klangstrom-arduino/stm32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# KLANGSTROM board

Klangstrom.name=Klangstrom (STM32)
Klangstrom.build.core=arduino
Klangstrom.build.board=Klangstrom
Klangstrom.build.variant_h=variant_{build.board}.h
Klangstrom.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# KLST_TINY board
Klangstrom.menu.pnum.KLST_TINY=KLST_TINY(STM32F446RE)
Klangstrom.menu.pnum.KLST_TINY.node=KLST_TINY
Klangstrom.menu.pnum.KLST_TINY.upload.maximum_size=524288
Klangstrom.menu.pnum.KLST_TINY.upload.maximum_data_size=131072
Klangstrom.menu.pnum.KLST_TINY.build.mcu=cortex-m4
Klangstrom.menu.pnum.KLST_TINY.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Klangstrom.menu.pnum.KLST_TINY.build.board=KLST_TINY
Klangstrom.menu.pnum.KLST_TINY.build.series=STM32F4xx
Klangstrom.menu.pnum.KLST_TINY.build.product_line=STM32F446xx
Klangstrom.menu.pnum.KLST_TINY.build.variant=KLST_TINY
Klangstrom.menu.pnum.KLST_TINY.build.cmsis_lib_gcc=arm_cortexM4lf_math

# KLST_CORE board
Klangstrom.menu.pnum.KLST_CORE=KLST_CORE(STM32H743II)
Klangstrom.menu.pnum.KLST_CORE.node=KLST_CORE
Klangstrom.menu.pnum.KLST_CORE.upload.maximum_size=2097152
Klangstrom.menu.pnum.KLST_CORE.upload.maximum_data_size=524288
Klangstrom.menu.pnum.KLST_CORE.build.mcu=cortex-m7
Klangstrom.menu.pnum.KLST_CORE.build.flags.fp=-mfpu=fpv5-d16 -mfloat-abi=hard
Klangstrom.menu.pnum.KLST_CORE.build.board=KLST_CORE
Klangstrom.menu.pnum.KLST_CORE.build.series=STM32H7xx
Klangstrom.menu.pnum.KLST_CORE.build.product_line=STM32H743xx
Klangstrom.menu.pnum.KLST_CORE.build.variant=KLST_CORE
Klangstrom.menu.pnum.KLST_CORE.build.cmsis_lib_gcc=arm_cortexM7lfsp_math

# Upload menu
Klangstrom.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Klangstrom.menu.upload_method.dfuMethod.upload.protocol=2
Klangstrom.menu.upload_method.dfuMethod.upload.options=-g
Klangstrom.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Klangstrom.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Klangstrom.menu.upload_method.swdMethod.upload.protocol=0
Klangstrom.menu.upload_method.swdMethod.upload.options=-g
Klangstrom.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

################################################################################
# Serialx activation
Klangstrom.menu.xserial.generic=Enabled (generic 'Serial')
Klangstrom.menu.xserial.none=Enabled (no generic 'Serial')
Klangstrom.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Klangstrom.menu.xserial.disabled=Disabled (No Serial support)
Klangstrom.menu.xserial.disabled.build.xSerial=

# USB connectivity
Klangstrom.menu.usb.none=None
Klangstrom.menu.usb.DEVICE_MouseKeyboard=USB Device Mouse+Keyboard
Klangstrom.menu.usb.DEVICE_MouseKeyboard.build.enable_usb=-DUSE_TINYUSB -DTINYUSB_MOUSE_KEYBOARD_DEVICE -DHAL_PCD_MODULE_ENABLED
Klangstrom.menu.usb.DEVICE_MIDI=USB Device MIDI
Klangstrom.menu.usb.DEVICE_MIDI.build.enable_usb=-DUSE_TINYUSB -DTINYUSB_MIDI_DEVICE -DHAL_PCD_MODULE_ENABLED
Klangstrom.menu.usb.HOST=USB Host Mouse+Keyboard+MIDI
Klangstrom.menu.usb.HOST.build.enable_usb=-DUSE_USBHOST -DHAL_HCD_MODULE_ENABLED
Klangstrom.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Klangstrom.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Klangstrom.menu.usb.CDC=CDC (no generic 'Serial')
Klangstrom.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Klangstrom.menu.xusb.FS=Low/Full Speed
Klangstrom.menu.xusb.HS=High Speed
Klangstrom.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Klangstrom.menu.xusb.HSFS=High Speed in Full Speed mode
Klangstrom.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
Klangstrom.menu.opt.osstd=Smallest (-Os default)
Klangstrom.menu.opt.o1std=Fast (-O1)
Klangstrom.menu.opt.o1std.build.flags.optimize=-O1
Klangstrom.menu.opt.o2std=Faster (-O2)
Klangstrom.menu.opt.o2std.build.flags.optimize=-O2
Klangstrom.menu.opt.o3std=Fastest (-O3)
Klangstrom.menu.opt.o3std.build.flags.optimize=-O3
Klangstrom.menu.opt.ogstd=Debug (-g)
Klangstrom.menu.opt.ogstd.build.flags.optimize=-g -Og

# C Runtime Library
Klangstrom.menu.rtlib.nano=Newlib Nano (default)
Klangstrom.menu.rtlib.nanofp=Newlib Nano + Float Printf
Klangstrom.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Klangstrom.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Klangstrom.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Klangstrom.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Klangstrom.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Klangstrom.menu.rtlib.full=Newlib Standard
Klangstrom.menu.rtlib.full.build.flags.ldspecs=
